soumend80/ESP8266/Particle Counter PMS7003/ESP8266HTTPUpdateServerCustom.h
#ifndef __HTTP_UPDATE_SERVER_CUSTOM_H
#define __HTTP_UPDATE_SERVER_CUSTOM_H

#include <ESP8266WebServer.h>

namespace esp8266httpupdateservercustom {
using namespace esp8266webserver;

template <typename ServerType>
class ESP8266HTTPUpdateServerCustomTemplate
{
  public:
    ESP8266HTTPUpdateServerCustomTemplate(bool serial_debug=false);

    void setup(ESP8266WebServerTemplate<ServerType> *server)
    {
      setup(server, emptyString, emptyString);
    }

    void setup(ESP8266WebServerTemplate<ServerType> *server, const String& path)
    {
      setup(server, path, emptyString, emptyString);
    }

    void setup(ESP8266WebServerTemplate<ServerType> *server, const String& username, const String& password)
    {
      setup(server, "/update", username, password);
    }

    void setup(ESP8266WebServerTemplate<ServerType> *server, const String& path, const String& username, const String& password);

    void updateCredentials(const String& username, const String& password)
    {
      _username = username;
      _password = password;
    }

  protected:
    void _setUpdaterError();

  private:
    bool _serial_output;
    ESP8266WebServerTemplate<ServerType> *_server;
    String _username;
    String _password;
    bool _authenticated;
    String _updaterError;
};

};

#include "ESP8266HTTPUpdateServerCustom-impl.h"


using ESP8266HTTPUpdateServerCustom = esp8266httpupdateservercustom::ESP8266HTTPUpdateServerCustomTemplate<WiFiServer>;

namespace BearSSL {
using ESP8266HTTPUpdateServerSecure = esp8266httpupdateservercustom::ESP8266HTTPUpdateServerCustomTemplate<WiFiServerSecure>;
};

namespace axTLS {
using ESP8266HTTPUpdateServerSecure = esp8266httpupdateservercustom::ESP8266HTTPUpdateServerCustomTemplate<WiFiServerSecure>;
};

#endif
